package z_homework;

public class Example1 {

	public static void main(String[] args) {
		/* 맞출때까지 계속하는 야구게임
		 * 중복없는 랜덤한 세자리 숫자를 생성한다
		 * 자리와 숫자가 일치하면 스트라이크 +1
		 * 자리는 다르지만 숫자가 일치하면 볼 +1
		 * 일치하는 숫자가 없으면 아웃 +1
		 * (정답 : 7 8 4)
		 * 세자리의 숫자 입력 >> 456
		 * 1차시도(456) : 05 18 20
		 * -----------------------
		 * 세자리의 숫자 입력 >> 785
		 * 2차시도(785) : 25 08 10
		 * ------------------------
		 * 세자리의 숫자 입력 >> 784
		 * 3차시도(784) : 35 08 00
		 */
		

		/* 가상의 딜러(뱅커)와 즐길수 있는 21 게임을 만들어보자(최대 3라운드)
		 * 카드는 1~13가지 숫자로 구성되어있으며, 각 숫자카드는 4장씩 존재한다
		 * =========================================
		 * 1.게임시작    0.게임종료
		 * =========================================
		 * 원하는메뉴를 입력해주세요 >>
		 */
		
		
	}

}
